//2554709 黒田蒼史 4月15日作成

//九九の表を画面に出力するプログラムを作成する
//for文の二重ループを使い、計算して表示する


/*soshi@soshinoMacBook-Air 02 % ./9x9
   |  1  2  3  4  5  6  7  8  9
 --+---------------------------
  1|  1  2  3  4  5  6  7  8  9
  2|  2  4  6  8 10 12 14 16 18
  3|  3  6  9 12 15 18 21 24 27
  4|  4  8 12 16 20 24 28 32 36
  5|  5 10 15 20 25 30 35 40 45
  6|  6 12 18 24 30 36 42 48 54
  7|  7 14 21 28 35 42 49 56 63
  8|  8 16 24 32 40 48 56 64 72
  9|  9 18 27 36 45 54 63 72 81
  */

  
#include <stdio.h>

int main(void){
    int num1,num2;

//1行目
    printf("   |");
    for (num2=1;num2<=9;num2=num2+1)
        {printf("%3d",num2);}
    printf("\n");
//2行目
    printf(" --+---------------------------");
    printf("\n");
//3行目から
    for (num1=1;num1<=9;num1=num1+1){
        printf("%3d|",num1);

        for (num2=1;num2<=9;num2=num2+1){
            printf("%3d",num2*num1);}

        printf("\n");
    
    }

    return 0;

}

