//2554709　黒田蒼史　4月15日作成

//sudokuBoard.c
//＊と数字からなる図形を出力するプログラム
//数字はprintf関数の %d を使って出力すること。また、printf("*************"); 
//などのように長い文字列を直接出力しては練習にならないので、カウンタ変数などを使って繰り返し処理を記述すること。


/*soshi@soshinoMacBook-Air 02 % ./sudokuBoard
*************************
* 1 2 3 * 1 2 3 * 1 2 3 *
* 4 5 6 * 4 5 6 * 4 5 6 *
* 7 8 9 * 7 8 9 * 7 8 9 *
*************************
* 1 2 3 * 1 2 3 * 1 2 3 *
* 4 5 6 * 4 5 6 * 4 5 6 *
* 7 8 9 * 7 8 9 * 7 8 9 *
*************************
* 1 2 3 * 1 2 3 * 1 2 3 *
* 4 5 6 * 4 5 6 * 4 5 6 *
* 7 8 9 * 7 8 9 * 7 8 9 *
*************************
*/


#include <stdio.h>

int main(void) {
    int a, b, c, d;

    for (a = 0; a < 3; a=a+1) {

        for (b = 0; b < 25; b=b+1) {
            printf("*");
        }
        printf("\n");

        for (b = 0; b < 3; b++) {
            for (c = 0; c < 3; c=c+1) {
                printf("*");

                for (d = 1; d <= 3; d++) {
                    printf(" %d", b * 3 + d);
                }

                printf(" ");
            }
            printf("*\n");
        }
    }

    for (b = 0; b < 25; b=b+1) {
        printf("*");
    }
    printf("\n");

    return 0;
}